Revit 2027 API
ParameterTypeId.StairsAttrTreadMaterial Property
 "Tread Material"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsAttrTreadMaterial { get; }
Public Shared ReadOnly Property StairsAttrTreadMaterial As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsAttrTreadMaterial {
	ForgeTypeId^ get ();
}
static member StairsAttrTreadMaterial : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace